{"keras_version": "2.2.4", "config": {"layers": [{"config": {"trainable": true, "strides": [1, 1], "bias_initializer": {"config": {}, "class_name": "Zeros"}, "dilation_rate": [1, 1], "kernel_initializer": {"config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}, "class_name": "VarianceScaling"}, "bias_regularizer": null, "kernel_constraint": null, "activity_regularizer": null, "bias_constraint": null, "filters": 32, "use_bias": true, "padding": "valid", "data_format": "channels_last", "kernel_size": [3, 3], "batch_input_shape": [null, 28, 28, 1], "kernel_regularizer": null, "name": "conv2d_1", "dtype": "float32", "activation": "relu"}, "class_name": "Conv2D"}, {"config": {"trainable": true, "strides": [1, 1], "bias_initializer": {"config": {}, "class_name": "Zeros"}, "dilation_rate": [1, 1], "kernel_initializer": {"config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}, "class_name": "VarianceScaling"}, "bias_regularizer": null, "kernel_constraint": null, "activity_regularizer": null, "bias_constraint": null, "filters": 64, "use_bias": true, "padding": "valid", "data_format": "channels_last", "kernel_size": [3, 3], "kernel_regularizer": null, "name": "conv2d_2", "activation": "relu"}, "class_name": "Conv2D"}, {"config": {"trainable": true, "strides": [2, 2], "padding": "valid", "data_format": "channels_last", "pool_size": [2, 2], "name": "max_pooling2d_1"}, "class_name": "MaxPooling2D"}, {"config": {"trainable": true, "rate": 0.25, "seed": null, "noise_shape": null, "name": "dropout_1"}, "class_name": "Dropout"}, {"config": {"trainable": true, "name": "flatten_1", "data_format": "channels_last"}, "class_name": "Flatten"}, {"config": {"trainable": true, "kernel_initializer": {"config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}, "class_name": "VarianceScaling"}, "bias_regularizer": null, "kernel_constraint": null, "activity_regularizer": null, "bias_constraint": null, "use_bias": true, "activation": "relu", "bias_initializer": {"config": {}, "class_name": "Zeros"}, "units": 128, "kernel_regularizer": null, "name": "dense_1"}, "class_name": "Dense"}, {"config": {"trainable": true, "rate": 0.5, "seed": null, "noise_shape": null, "name": "dropout_2"}, "class_name": "Dropout"}, {"config": {"trainable": true, "kernel_initializer": {"config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}, "class_name": "VarianceScaling"}, "bias_regularizer": null, "kernel_constraint": null, "activity_regularizer": null, "bias_constraint": null, "use_bias": true, "activation": "softmax", "bias_initializer": {"config": {}, "class_name": "Zeros"}, "units": 10, "kernel_regularizer": null, "name": "dense_2"}, "class_name": "Dense"}], "name": "sequential_1"}, "class_name": "Sequential", "backend": "tensorflow"}